[
{"type":"header","version":"5.2.2","comment":"Export to JSON plugin for PHPMyAdmin"},
{"type":"database","name":"u512385696_portfoliodb"},
{"type":"table","name":"blogs","database":"u512385696_portfoliodb","data":
[
{"id":"1","title":"7 Days in the Mounts","description":"A poetic journey through mountains where nature amplifies emotion and peace is found in silence.","content":"<img src=\"https:\/\/api.rohanghalib.com\/media\/mountain2.png\" class=\"img-blog\">\n\nThere is a kind of magic in those remote peaks. Surrounded by emerald forests and streams fed by ancient glaciers,  \n**nature becomes an amplifier for every feeling**. Below you, melting glaciers feed crystal-clear streams – many call glacial ice among the purest natural waters.\nAs you look out, the world seems to shrink: towers of pine that once loomed high now huddle like tiny ants in the mist. Clouds form almost miraculously at your feet, as moist air rising up the mountain cools and condenses into fog and rain.  \nIn that moment the aura is otherworldly.  \n\nAs John Muir observed, _“Climb the mountains and get their good tidings. Nature’s peace will flow into you as sunshine flows into trees.”_  \nThe air is sharp and cold, the sky infinitely high, and for once you feel bot h enormously small _and_ alive to everything around you.\n\n<img src=\"https:\/\/api.rohanghalib.com\/media\/mountain1.png\" class=\"img-blog\">\n\nBut there is a warning written in the stillness: whatever you carry in your heart will echo back at you.  \nIn complete silence, with nothing but sky and stone around you, old worries no longer have distractions; **they grow louder**.  \nIf you brought a heavy heart or unspoken regrets, those ghosts follow you like shadows on the trail.  \nIn such pure solitude your remorse is undiluted. Instead of finding comfort, many discover that _negative thoughts only become more vivid_ when there is nothing to buffer them.  \nAs the mountains stretch and your gaze deepens into valleys, there is nowhere left to hide.\n\n(This is why wise travelers say not to seek the hills as a cure for a troubled mind.)  \nWithout the usual noise and routine, your inner doubts stand on full display, reminding you how small your problems are in the vast world – a humbling thought, but not always a comforting one.\n\nOn the other hand, if you climb the trail with **an open heart and peace in your mind**, the mountains feel like a kind of heaven.  \nThey seem to reward every gentle thought. The sun warms the rocks, the breeze carries only good tidings, and even the silence feels full of possibility.\n\nAs Ralph Waldo Emerson urged, _“Live in the sunshine, swim the sea, drink the wild air’s salubrity.”_  \nIn these heights, you literally drink cold mountain air that tastes like freedom.  \nEach step feels lighter than the last, and even exhaustion is sweet.  \nYou find that quiet peace grows inside you until it spills into every waking moment, like dawn light spilling over the peaks.\n\nWhen it’s time to descend, people often ask, “Did you have fun?”  \nI realized _fun_ up there wasn’t about laughter or music or crowds.  \nIt was about something deeper.  \nAs Muir said, _“Only by going alone in silence, without baggage, can one truly get into the heart of the wilderness.”_  \nOut there, the loudest sound is your own heartbeat – and for once, you _listen_.\n\nI learned that sometimes the most joyous moments come in total stillness.  \nComing home, I felt oddly lighter, as if each mountain breeze had carried away a worry.  \nMy greatest takeaway from those seven days was simple and quiet:  \n**love isn’t always the excitement we imagine; sometimes it’s the tender silence between two soul-deep breaths, the trust in stillness.**\n\n_“Oh, how this world has created such a misconception of love.”_  \n**— Rohan Ghalib**\n"},
{"id":"4","title":"Known By Many","description":".","content":"<iframe data-testid=\"embed-iframe\" style=\"border-radius:12px\" src=\"https:\/\/open.spotify.com\/embed\/track\/5h9QIQ7P4OLw59yxZkMrNm?utm_source=generator\" width=\"70%\" height=\"100\" frameBorder=\"0\" allowfullscreen=\"\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"><\/iframe>\n\nThere's a peculiar sadness that comes when you realize that despite having good friends, a supportive community, and people to talk to, the more you communicate with others, the more isolated you feel within yourself. You begin caring so much about maintaining good relationships with everyone that you start losing your authentic self in the process. You transform into a public identity rather than remaining a unique human being. You feel compelled to present the most perfect version of yourself, even with your closest friends, because paradoxically, when everyone knows you, no one truly knows you.\n\nThen there are times when, even surrounded by wonderful people, you can't share your genuine feelings. Not because they would judge you, but because there's an underlying awkwardness. You realize that your friends are your inspirations, you become what you think and whom you associate with. You can't speak directly to them about this. Instead, you adopt different personalities with different people to accommodate their feelings. And there's that anxious realization that YOU are the one constantly changing your moods, personalities, and conversation topics according to different people, not them. They're simply being their authentic selves.\n\nSome people call this a **\"Leader Personality,\"** but is a leader ever born to not be a genuine version of himself? Is a leader born to always hide and accommodate according to people? The question sometimes trembles my soul, always left alone with this dark and upset weather, and the sudden urge to jot down my thoughts and feelings. And then keeping these notes like scripts in my private Notion feels like I've wasted my time writing this because no one is reading it. Even I myself am not going to read this again in the future. It is just... what if we all had a special person who worked for us like Notion? A good listener? Who listens to your feelings, relaxes you, calms you down, makes you feel comfortable, and like Notion has a sense of ASMR while writing down your feelings, what if that one person gives you that comforting feeling? That is all a Man Needs.\n\n*As I always say, The World's idea of love is utterly **misleading.***\n\n***—Rohan Ghalib***"},
{"id":"5","title":"Ali Bhai","description":"","content":"<iframe data-testid=\"embed-iframe\" style=\"border-radius:12px\" src=\"https:\/\/open.spotify.com\/embed\/track\/64xC67m2VV24RykHrBH1kw?utm_source=generator\" width=\"70%\" height=\"152\" frameBorder=\"0\" allowfullscreen=\"\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"><\/iframe>\n\nAli's life had taken an unexpected turn lately. These past few days had taught him lessons he never thought he'd have to learn. This chapter felt foreign compared to everything he'd lived through before.\n\nIn previous hardships, Ali always found someone standing beside him. But now, he stood alone in the silence. The thought crept in, perhaps he was in the wrong this time, since not a single soul came forward to defend him.\n\nWhat Ali uncovered cut deep, altering his perception of reality. These weren't small revelations but ones that fractured the very core of his beliefs.\n\nAli lived by a strict code about others speaking behind his back. He never allowed it in his presence. While he could face criticism directly, he believed people should speak well of him when he wasn't around.\n\n> \"Doesn't everyone want this?\" he questioned himself.  \n> \"We all pretend we don't care about whispers behind our backs, but in our hearts, don't we all hope to be spoken of with kindness?\"\n\nHe figured everyone must face such disillusionment at least once. Lately, he found solace in old melodies about betrayal. Hemant Kumar's *\"Jane Wo Kaise\"* and Vital Signs' *\"Aitebar\"* felt like they were capturing his exact emotions, as if written just for this moment in his life.\n\n<img src=\"https:\/\/api.rohanghalib.com\/media\/railway.jpg\" class=\"img-blog\">\n\nAli tried clinging to the belief that everything happens with purpose. Though what he faced now felt unbearable, he consoled himself that experiencing it later might have broken him completely.\n\nThe lesson hit him like a cold wind: **never expect reciprocity for your goodwill.** Life rarely works that way. People can wound you without a second thought about what you've given them. This generation seemed to have perfected the art of taking things for granted.\n\nA verse from an old poem kept replaying in his mind:  \n***\"Bichar gaya har sathi de kar pal do pal ka sath\"***\n\nIt dawned on Ali that introspective souls like him rarely find genuine connection. On the surface, everyone seemed to know him. He exchanged warm greetings with countless faces, discovering mutual connections wherever he went. Yet if someone asked whether he ever shared his true self with any of them, he'd have to admit he hadn't.\n\nAmong all those who surrounded him, Ali moved through life wearing masks. He feared making others feel excluded, so he treated everyone with kindness. Perhaps he dreaded hurting feelings too much. That's why he'd offer elaborate apologies for minor matters, avoiding conflicts that ego might create.\n\nEvery few years, Ali would meet someone who seemed to truly understand him. It would feel like finally finding that person who would remain by his side as a true confidant.\n\nBut inevitably a pattern emerged. Ali realized he was either more mature than his years suggested or somehow less so. Both qualities, from his experience, brought more pain than joy.\n\nPeople initially gravitated toward his authentic nature. They'd share thoughts, grow closer, and gradually he would reveal his vulnerabilities. But Ali never remained stationary in life. His relentless drive meant he often surpassed them in various aspects, usually without intention.\n\nWhat began as inspiration, what Ali simply called *\"envy\"* in plainer terms, transformed over time. They would attempt to mirror his achievements. Most couldn't, though Ali never thought they needed to. Their inability to reach similar heights converted their initial admiration into something darker, **jealousy.**\n\n> \"Jealousy from those closest to you is nothing short of devastation,\" Ali reflected.\n\nAs jealousy took root, their friendship would maintain its appearance while deteriorating beneath. They grew reluctant to defend him in his absence. His successes became bitter pills for them to swallow. The person who once inspired them now served as their cautionary tale.\n\nTheir social circles worsened matters, comparing them unfavorably to Ali. The assumption was that anyone spending time with him who couldn't match his success must be fundamentally lacking. This despite the principle that in physics, *similar charges repel each other.* Ali believed people with different intellectual perspectives connected most meaningfully because they always had something fresh to exchange.\n\nAli's mind always circled back to one conclusion: **people like him were destined to walk alone.**\n\nPhrases he once dismissed as melodramatic now rang with truth:  \n> \"Trust no one in this world. I mean absolutely no one!\"\n\nHe realized people would dissect his character until he couldn't face the world. Though anger burned within, he remained silent, having revealed his heart's most fragile corners to them. It felt like emotional entrapment.\n\nAli accepted that carrying the weight of his thoughts alone, however painful, was preferable to mistaking anyone as worthy of hearing them. As the saying warns, *\"This world is false, people will use you.\"*\n\nNo matter how genuinely he wished others well, people would still wound him. They convinced themselves they possessed something special that made him care for them, conveniently forgetting they had approached him first.\n\nHe learned that **privacy holds value only to its owner.** To others, it means nothing. People would casually expose your vulnerabilities for amusement without the slightest remorse.\n\nAli kept others' secrets too, but could never bring himself to humiliate someone publicly. The very idea horrified him, but sadly, few shared his principles.\n"}
]
}
]
